# Técnicas de limpieza de datos

In [3]:
import pandas as pd

In [7]:
#users = pd.read_table('http://bit.ly/movieusers', sep='|')
users = pd.read_table('./datasets/movieusers', sep='|')
users

       1  24  M     technician  85711
0      2  53  F          other  94043
1      3  23  M         writer  32067
2      4  24  M     technician  43537
3      5  33  F          other  15213
4      6  42  M      executive  98101
..   ...  .. ..            ...    ...
937  939  26  F        student  33319
938  940  32  M  administrator  02215
939  941  20  M        student  97229
940  942  48  F      librarian  78209
941  943  22  M        student  77841

[942 rows x 5 columns]

In [10]:
user_cols = ['user_id', 'age', 'gender', 'occupation', 'zip_code']
users = pd.read_table('./datasets/movieusers', sep='|', header=None, names=user_cols, index_col='user_id')
users.head()

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

In [12]:
users.shape

(943, 4)

## [1]. Verificar duplicados

In [20]:
# Detectar códigos postales duplicados. True si es un valor duplicado
users.zip_code.duplicated().tail(10)

user_id
934     True
935    False
936    False
937     True
938    False
939    False
940     True
941    False
942    False
943    False
Name: zip_code, dtype: bool

In [22]:
# Contar valores duplicados (True es 1, False es 0)
users.zip_code.duplicated().sum()

148

In [24]:
users.age.duplicated().sum()

882

In [26]:
users.occupation.duplicated().sum()

922

In [28]:
# Detectar filas del dataset duplicadas: verdadero si la fila entera es igual a la anterior
users.duplicated().tail()

user_id
939    False
940    False
941    False
942    False
943    False
dtype: bool

In [30]:
users.duplicated().sum()

7

Se ha verificado que existen 7 registros duplicados.

In [ ]:
# Examinar las filas duplicadas (ignorando la primera ocurrencia)
users.loc[users.duplicated(keep='first'), :]